# ConvertLinkedCADFormats Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..ConvertLinkedCADFormats Property
NavisworksExportOptions Class See Also
---
True to convert linked CAD formats, false otherwise. Default value is true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool ConvertLinkedCADFormats { get; set; }
```

Visual Basic
---
```text
Public Property ConvertLinkedCADFormats As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ConvertLinkedCADFormats {
	bool get ();
	void set (bool value);
}
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace